{
  "issue_id": 6609,
  "issue_url": "https://github.com/apache/rocketmq/issues/6609",
  "title": "CQ building exceeds confirmOffset when node restarts to recover in ha mode",
  "description_text": "The issue tracker is used for bug reporting purposes **ONLY** whereas feature request needs to follow the [RIP process](https://github.com/apache/rocketmq/wiki/RocketMQ-Improvement-Proposal). To avoid unnecessary duplication, please check whether there is a previous issue before filing a new one.\r\n\r\nIt is recommended to start a discussion thread in the [mailing lists](http://rocketmq.apache.org/about/contact/) or [github discussions](https://github.com/apache/rocketmq/discussions) in cases of discussing your deployment plan, API clarification, and other non-bug-reporting issues.\r\nWe welcome any friendly suggestions, bug fixes, collaboration, and other improvements.\r\n\r\nPlease ensure that your bug report is clear and self-contained. Otherwise, it would take additional rounds of communication, thus more time, to understand the problem itself.\r\n\r\nGenerally, fixing an issue goes through the following steps:\r\n1. Understand the issue reported;\r\n1. Reproduce the unexpected behavior locally;\r\n1. Perform root cause analysis to identify the underlying problem;\r\n1. Create test cases to cover the identified problem;\r\n1. Work out a solution to rectify the behavior and make the newly created test cases pass;\r\n1. Make a pull request and go through peer review;\r\n\r\nAs a result, it would be very helpful yet challenging if you could provide an isolated project reproducing your reported issue. Anyway, please ensure your issue report is informative enough for the community to pick up. At a minimum, include the following hints:\r\n\r\n**BUG REPORT**\r\n\r\n1. Please describe the issue you observed:\r\nwe found this phenomenon in the following case :\r\n[1] first, node1 as master, node2 as slave\r\n[2] 2023-04-17 15:24:22, node1 is down, node2 will be elected as master\r\n[3] 2023-04-17 15:24:23, node2 is down right after being elected as master\r\n[4] 2023-04-17 15:26:03, node1 restarts\r\n[5] 2023-04-17 15:46:05, node2 restarts\r\n[6] 2023-04-17 15:46:20, node2 is elected as master and node1 is elected as slave.\r\n\r\n![image](https://user-images.githubusercontent.com/10379042/232707435-3bb1950d-8a54-4c34-bf27-684e6a0cf8e2.png)\r\n\r\nwe found that 4 messages was lost, those  4 messages was stored to node2's commitlog at 2023-04-17 15:46:42\r\n![image](https://user-images.githubusercontent.com/10379042/232707614-ea2e3899-dae6-47e2-83a8-ac47c817d557.png)\r\n\r\nBy checking the recovery log of node1, it is found that node1 builds cq with 4 dirty messages which will be truncate in the future.\r\n![image](https://user-images.githubusercontent.com/10379042/232710514-d1f32589-c976-468d-9af1-50ffe92899ab.png)\r\n![image](https://user-images.githubusercontent.com/10379042/232710444-6cc0d184-7d8e-4929-b4ed-8dbce88d6c43.png)\r\n\r\n\r\nAlso, broker has enabled reading messages from the slave. Client subscribes node1 at  2023-04-17 15:26:24 and consumes those \r\n4 dirty messages, then commit the offset of these queue.\r\n\r\nAfter node2 is elected as master and node1 is elected to slave, those 4 dirty messages is truncate by node1, and another 4 new messages is appended to commitlog. However, the offset of these messages has already being commited.\r\n\r\nThis also explains why messages are lost.\r\n\r\n2. Please tell us about your environment:\r\n\r\n3. Other information (e.g. detailed explanation, logs, related issues, suggestions on how to fix, etc):\r\n\r\n**FEATURE REQUEST**\r\n\r\n1. Please describe the feature you are requesting.\r\n\r\n2. Provide any additional detail on your proposed use case for this feature.\r\n\r\n3. Indicate the importance of this issue to you (blocker, must-have, should-have, nice-to-have). Are you currently using any workarounds to address this issue?\r\n\r\n4. If there are some sub-tasks involved, use -[] for each sub-task and create a corresponding issue to map to the sub-task:\r\n\r\n- [sub-task1-issue-number](example_sub_issue1_link_here): sub-task1 description here, \r\n- [sub-task2-issue-number](example_sub_issue2_link_here): sub-task2 description here,\r\n- ...\r\n"
}